Repository: JonasMikaelMellin/login_simulation
Catalog: lib/l10n/app_*.arb
Languages: sv

# adminChangePasswordTitle
source: Whedcapp - Change password
sv: Whedcapp - Ändra lösenord

# adminChangePasswordButton
source: Change password
sv: Ändra lösenord

# adminCommentsDatabaseMgmtEmptyTableMessage
source: There are no comments in the dabase yet
sv: Det finns inga kommentarer i databasen.

# adminCommentsDatabaseMgmtScreenTitle
source: Whedcapp - Comments view management
sv: Whedcapp - Kommentarsvyhantering

# adminDatabaseMgmtBackupButton
source: Backup database
sv: Säkerhetskopiera databasen

# adminDatabaseMgmtClearButton
source: Clear database
sv: Rensa databasen

# adminDatabaseMgmtDumpButton
source: Extract data
sv: Extrahera data

# adminDatabaseMgmtEmptyTableMessage
source: There are no samples in the dabase yet
sv: Det finns inga mätvärden i databasen ännu

# adminDatabaseMgmtExtractDataTitle
source: Please choose the file for the output in CSV format
sv: Vänligen välj en fil för att spara i CSV format

# adminDatabaseExtractDataScreenTitle
source: Whedcapp - Extract data
sv: Whedcapp - Extrahera data

# adminDatabaseMgmtScreenTitle
source: Whedcapp - Database management
sv: Whedcapp - Databashantering

# adminLabelAdmin
source: Administrator?
sv: Administratör?

# adminLabelComments
source: Comments?
sv: Kommentarer?

# adminLabelEnabled
source: Enabled?
sv: Aktiverad?

# adminLabelId
source: Identity
sv: Identitet

# adminLabelMetric
source: Metric
sv: Mått

# adminLabelPassword
source: Password
sv: Lösenord

# adminLabelTimestamp
source: Timestamp
sv: Tidpunkt

# adminLabelUid
source: User number
sv: Användarnummer

# adminLabelWid
source: Sample identity
sv: Mätvärdesidentitet

# adminHelpTextAlias
source: Enter alias
sv: Mata in alias

# adminHelpTextId
source: Enter Identity
sv: Mata in identitet

# adminHelpTextPassword
source: Enter Password
sv: Mata in lösenord

# adminScreenUserManagementButtonText
source: User management
sv: Användarhantering

# adminScreenCommentsDatabaseManagementButtonText
source: Comments view management
sv: Kommentarsvyhantering

# adminScreenDatabaseManagementButtonText
source: Sample database management
sv: Mätvärdesdatabashantering

# adminScreenTitle
source: Whedcapp - Administrator
sv: Whedcapp - Administratör

# adminScreenNumberOfRecords
source: Number of records
sv: Antal poster

# adminScreenNumberOfUsers
source: Number of users
sv: Antal användare

# adminCrudUserScreenCreateTitle
source: Whedcapp - Add user
sv: Whedcapp - Lägg till användare

# adminCrudUserScreenDeleteTitle
source: Whedcapp - Confirm delete user
sv: Whedcapp - Bekräfta borttagande av användare

# adminCrudUserScreenReadTitle
source: Whedcapp - View user
sv: Whedcapp - Visa upp användare

# adminCrudUserScreenUpdateTitle
source: Whedcapp - Update user
sv: Whedcapp - Uppdatera användare

# adminUserMgmtScreenTitle
source: Whedcapp - User management
sv: Whedcapp - Användarhantering

# addDataNotePrompt
source: Enter data note
sv: Lägg till anteckning om data

# addDataNoteHelpText
source: To add a data note, enter text in the form field, then press '{button}'
sv: För att lägga till en anteckning, lägg in text i fältet och tryck sedan '{button}'

# addDataNoteScreenTitle
source: Whedcapp - Add data note
sv: Whedcapp - Lägg till anteckning om data

# addValueScreenTitle
source: Whedcapp - Add data value at {date}
sv: Whedcapp - Lägg till data vid {date}

# cancelButtonText
source: Cancel
sv: Avbryt

# changeToAdminPageText
source: Switch to admin page
sv: Byt till administratörssida

# changeToParticipantPageText
source: Switch to participant page
sv: Byt till deltagarsida

# configurationChooseColor
source: Choose color for {series}
sv: Välj färg för {series}

# configurationSelectLanguagePrompt
source: Select interface language
sv: Välj gränssnittsspråk

# configurationSelectContentLanguagePrompt
source: Select content language
sv: Välj innehållsspråk

# configurationTitle
source: Whedcapp configuration
sv: Whedcappkonfiguration

# editDataNoteScreenTitle
source: Whedcapp - Edit notes concerning data
sv: Whedcapp - Anteckningar

# enterValueQuestion
source: How would you rate your sense of "{series}" on a scale 0 (really bad) to 10 (really good)?
sv: Hur skulle du skatta din känsla av "{series}", på en skala 0 (riktigt dåligt) till 10 (riktigt bra)?

# enterValueQuestionLoneliness
source: How would you rate your sense of “Loneliness” on a scale from 0 (none) to 10 (worst imaginable)?
sv: Hur skulle du vilja skatta din känsla av ”Ensamhet” på en skala från 0 (ingen) till 10 (värsta tänkbara)?

# enterValueQuestionSafety
source: How would you rate your sense of “Safety” on a scale from 0 (none) to 10 (best possible)?
sv: Hur skulle du vilja skatta din känsla av ”Trygghet” på en skala från 0 (ingen) till 10 (bästa möjliga)?

# enterValueQuestionSenseOfHome
source: How would you rate your sense of ”Feeling at home” on a scale from 0 (none) to 10 (best possible)?
sv: Hur skulle du vilja skatta din känsla av ”Hemkänsla” på en skala från 0 (ingen) till 10 (bästa möjliga)?

# enterValueQuestionWellBeing
source: How would you rate your sense of ”Well-being” on a scale from 0 (none) to 10 (best possible)?
sv: Hur skulle du vilja skatta din känsla av ”Välmående” på en skala från 0 (inget) till 10 (bästa möjliga)?

# loginIdentityPrompt
source: Enter identity
sv: Ange identitet

# loginIdentityHelperText
source: Enter a valid email address
sv: Ange en giltig e-postadress

# loginIdentityValidatorErrorMsg
source: Enter a valid email address
sv: Ange en giltig e-postadress

# loginPasswordPrompt
source: Enter password
sv: Ange lösenordet

# loginPasswordHelperText
source: Enter a password
sv: Ange ett lösenord

# loginPasswordValidatorErrorMsg
source: Password must be longer than 12 characters.
sv: Lösenordet måste vara längre än 12 tecken.

# loginFailedMsg
source: Login for {name} failed
sv: Inloggning som {name} misslyckades

# loginProcessingMsg
source: Logging is as {name}
sv: Loggar in som {name}

# logoutText
source: Logout
sv: Logga ut

# navDrawerTurnOffDemoMode
source: Turn off demo mode
sv: Stäng av demonstrationsläge

# navDrawerTurnOnDemoMode
source: Turn on demo mode
sv: Sätt på demonstrationsläge

# partScreenTitle
source: Whedcapp - Participant
sv: Whedcapp - Deltagare

# seriesWellbeing
source: Well-being
sv: Välmående

# seriesSenseOfHome
source: Feeling at home
sv: Hemkänsla

# seriesSafety
source: Safety
sv: Trygghet

# seriesLoneliness
source: Loneliness
sv: Ensamhet

# sideMenuTitle
source: Side menu
sv: Sidomeny

# welcomeScreenTitle
source: Welcome to Whedcapp
sv: Välkommen till Whedcapp

# welcomeText
source: Welcome to WHEdcapp (Well-being Health and Environment Data Collection App). In this app, you rate your sense of well-being, home, safety and loneliness over time on a scale from 0 to 10. The purpose of this app is be able to follow and collect data about your sense of well-being and related factors.
sv: Välkommen till WHEdcapp (Well-being Health and Environment Data Collection App). I denna app skattar du ditt välmående, känsla av hem, trygghet och ensamhet över tid på en skala från 0 till 10. Syftet med denna app är att kunna följa och samla data om ditt välbefinnande och relaterade faktorer.

# welcomeTitle
source: Welcome
sv: Välkommen
